/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: robhak <robhak@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/04/25 13:25:49 by robhak            #+#    #+#             */
/*   Updated: 2023/04/25 13:25:50 by robhak           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/* Retourne 1 si le caractère c est un caractère ASCII, 0 sinon */
int	ft_isascii(int c)
{
	return (c >= 0 && c <= 127);
}
